Name : Mohan  Email : mohandongara@gmail.com

In [1]:
import pandas as pd

In [2]:
#MINI CHALLENGE 1
portfolio_df  = pd.DataFrame({
    "Stock Symbols" :["Tesla","Apple","Meta"],
    "Number Of Shares" : [200,100,125],
    "Price Per Share" : [883,169,178]
})

print(portfolio_df)

portfolio_df['total value']=portfolio_df['Number Of Shares']*portfolio_df['Price Per Share']
print(portfolio_df)
print("Total Portfolio Value :",portfolio_df['total value'].sum())

  Stock Symbols  Number Of Shares  Price Per Share
0         Tesla               200              883
1         Apple               100              169
2          Meta               125              178
  Stock Symbols  Number Of Shares  Price Per Share  total value
0         Tesla               200              883       176600
1         Apple               100              169        16900
2          Meta               125              178        22250
Total Portfolio Value : 215750

In [3]:
bank_client_df = pd.DataFrame({'Bank client ID':[111, 222, 333, 444], 
                               'Bank Client Name':['Sid', 'Sanjeev', 'Neha', 'Sreeja'], 
                               'Net worth [Rs]':[3500, 29000, 10000, 2000], 
                               'Years with bank':[3, 4, 9, 5]})

In [4]:
#MINI CHALLENGE 2
netWorthAbove = bank_client_df[bank_client_df['Net worth [Rs]']>=5000]
print(netWorthAbove['Net worth [Rs]'].sum())

39000

In [5]:
#MINI CHALLENGE 3
def doubleStockPrice(stockPrice):
    return ((stockPrice*2)+100)

portfolio_df['total value']=portfolio_df['Number Of Shares']*portfolio_df['Price Per Share'].apply(doubleStockPrice)
print(portfolio_df)
print(portfolio_df['total value'].sum())

  Stock Symbols  Number Of Shares  Price Per Share  total value
0         Tesla               200              883       373200
1         Apple               100              169        43800
2          Meta               125              178        57000
474000

In [6]:
#MINI CHALLENGE 4
import pandas as pd
bank_client_df = pd.DataFrame({'Bank client ID':[111, 222, 333, 444], 
                               'Bank Client Name':['Sid', 'Sanjeev', 'Neha', 'Sreeja'], 
                               'Net worth [Rs]':[3500, 29000, 10000, 2000], 
                               'Years with bank':[3, 4, 9, 5]})
bank_client_df.sort_values(by = 'Net worth [Rs]', inplace = True) 
print(bank_client_df)

   Bank client ID Bank Client Name  Net worth [Rs]  Years with bank
3             444           Sreeja            2000                5
0             111              Sid            3500                3
2             333             Neha           10000                9
1             222          Sanjeev           29000                4

In [7]:
#MINI CHALLENGE 5
raw_data = {
        'Bank Client ID': [1, 2, 3, 4, 5],
        'First Name': ['Smith', 'Johnson', 'Williams', 'Brown', 'Jones'], 
        'Last Name': ['John', 'Michael', 'James', 'Robert', 'David'],
        'Annual Salary': [25000, 35000, 45000, 48000, 49000]}
allAccountDetails = pd.DataFrame(raw_data, columns = ['Bank Client ID', 'First Name', 'Last Name','Annual Salary'])
myAccount = pd.DataFrame({'Bank Client ID':[6],'First Name':["Mohan"],'Last Name':["Dongara"],'Annual Salary':[450000]})
allDetails = pd.concat([allAccountDetails, myAccount])
allDetails

   Bank Client ID First Name Last Name  Annual Salary
0               1      Smith      John          25000
1               2    Johnson   Michael          35000
2               3   Williams     James          45000
3               4      Brown    Robert          48000
4               5      Jones     David          49000
0               6      Mohan   Dongara         450000